What does the word "brave" mean?
What is the meaning of "gigantic"?
What does "adventure" mean?
What does "joyful" mean?
What is a "mysterious" person?
What does "delicious" mean?
What does "protect" mean?
What does "peaceful" mean?
What is the meaning of "ancient"?
What does "clumsy" mean?
What does the word "enthusiastic" mean?
What is the meaning of "generous"?
What does "eager" mean?
What does "bitter" mean?
What is "hilarious"?
What does "gloomy" mean?
What does "obedient" mean?
What does "silly" mean?
What is the meaning of "miserable"?
What does "brilliant" mean?
What does "superior" mean?
What is the meaning of "deceive"?
What does "persistent" mean?
What is the meaning of "cautious"?
What does "fragile" mean?
What is the meaning of "diverse"?
What does "apprehensive" mean?
What does "magnificent" mean?
What is the meaning of "bewildered"?
What does "tenacious" mean?
What is the meaning of "vivid"?
What does "contemplate" mean?
What is the meaning of "tranquil"?
What does "hostile" mean?
What is the meaning of "dormant"?
What does "arduous" mean?
What is the meaning of "meticulous"?
What does "resilient" mean?
What is the meaning of "diligent"?
What does "spontaneous" mean?
What does "audible" mean?
What is the meaning of "integral"?
What does "subtle" mean?
What does "exuberant" mean?
What is the meaning of "fortuitous"?
What does "benevolent" mean?
What does "impulsive" mean?
What is the meaning of "profound"?
What does "ominous" mean?
What is the meaning of "dormant"?
Not afraid
Very large
A trip or journey
Happy
A person who is hard to understand
Tasty
To keep safe
Quiet and calm
Old
Awkward
Very excited
Kind and giving
Ready and excited
Sharp and unpleasant
Very funny
Dark and sad
Doing what you're told
Funny and foolish
Very sad
Smart
Very good
To trick
Sticking with something despite difficulty
Careful
Delicate
Varied
Nervous and worried
Beautiful and grand
Confused
Determined
Clear and bright
To think carefully
Peaceful and calm
Unfriendly and aggressive
Sleeping
Difficult and tiring
Extremely careful and precise
Able to recover quickly
Hard-working
Unplanned
Able to be heard
Very important
Difficult to notice
Extremely joyful
Happening by chance
Kind and charitable
Acting without thinking
Deep and thoughtful
Suggesting something bad is going to happen
Not active
Scared
Shy
Cowardly
Tiny
Average
Slow
Boredom
Routine
Rest
Sad
Tired
Angry
Obvious
Predictable
Transparent
Tasteless
Sour
Disgusting
Harm
Ignore
Damage
Noisy
Aggressive
Disruptive
Modern
Recent
New
Graceful
Skilled
Quick
Disinterested
Unexcited
Dull
Selfish
Greedy
Stingy
Reluctant
Hesitant
Uninterested
Sweet
Sour
Salty
Boring
Sad
Serious
Cheerful
Happy
Bright
Disobedient
Rebellious
Unruly
Serious
Stern
Somber
Happy
Joyful
Excited
Dull
Unintelligent
Ordinary
Inferior
Average
Equal
Tell the truth
Assist
Help
Lazy
Indifferent
Hesitant
Careless
Reckless
Impulsive
Strong
Tough
Durable
Similar
Identical
Alike
Confident
Unconcerned
Calm
Unremarkable
Ordinary
Average
Clear-headed
Focused
Calm
Weak
Unsteady
Unfocused
Dull
Faint
Fuzzy
Ignore
Rush
Avoid
Loud
Restless
Chaotic
Friendly
Kind
Welcoming
Active
Energetic
Awake
Easy
Effortless
Simple
Careless
Hasty
Messy
Fragile
Weak
Delicate
Lazy
Indifferent
Carefree
Planned
Organized
Controlled
Silent
Quiet
Imperceptible
Unimportant
Minor
Insignificant
Obvious
Harsh
Loud
Depressed
Unexcited
Dull
Unlucky
Planned
Predetermined
Malevolent
Cruel
Selfish
Planned
Cautious
Thoughtful
Shallow
Superficial
Simple
Cheerful
Positive
Friendly
Awake
Active
Excited